const txt = `
Эл. адрес
Электронная торговля
Магазин
Корзина
Проверить
Открытки
Карты
Google Map
Листовка Карта
Календарь
Примечания
Todos
Контакты
Перемешать
Графики
Google Carts
Recharts
React Vis
React-Chart-2
React-Trend
Echart
Формы
Вход
Редактор
Формы с проверкой
Прогресс
Кнопка
Вкладка
Флажок
Радиобокс
Передача
Автозаполнение
Варианты коробки
Элементы пользовательского интерфейса
Значок
Карточки
Карусель
Collapse
Pop Over
Tooltip
Тег
График
Dropdown
Пагинация
Рейтинг
Дерево
Advanced Elements
React Dates
Code Mirror
Uppy Uploader
Drop Zone
Обратная связь
Alert
Modal
Message
Notification
Pop Confirm
Spin
Tables
Ant Tables
Pages
500
404
Sign In
Sign Up
Forgot Passwords
Reset Passwords
Invoice
Menu Levels
Item 1
Item 2
Option 1
Option 2
Option 3
Option 4
Blank Page
Github Search
Youtube Search
Change Language
Theme Switcher
Боковая панель
Верхняя панель
Фон
Основное название
Текст успеха
Информационный текст
Предупреждающий текст
Текст ошибки
Закрываемый тип оповещения
Значок Тип оповещения
Значок Информация Тип оповещения
советы по успеху
Подробное описание и советы по успешному копирайтингу.
Информационные примечания
Дополнительное описание и информация о копирайтинге.
Предупреждение
Это предупреждение о копирайтинге.
Ошибка
Это сообщение об ошибке о копирайтинге.
Модальный с настраиваемым нижним колонтитулом
Базовый модальный диалог.
Успех
Информация
Ошибка
Предупреждение
Modal
Модальное диалоговое окно подтверждения
Простой модальный диалог
Сообщение
Обычное сообщение
Обычные сообщения в качестве отзывов.
Показать обычное сообщение
Другие типы сообщений
Сообщения об ошибках успеха и типах предупреждений.
Настроить продолжительность
настроить продолжительность отображения сообщения с 1,5 с по умолчанию до 10 с.
Индивидуальная продолжительность отображения
Сообщение о загрузке
Отображение глобального индикатора загрузки, который асинхронно закрывается сам по себе.
Показать индикатор загрузки
Уведомление
Базовый
Самое простое использование, которое закрывает окно уведомлений через 4,5 с.
Откройте окно уведомлений
Продолжительность, по истечении которой окно уведомлений закрывается
Продолжительность можно использовать, чтобы указать, как долго уведомление остается открытым. По истечении времени продолжительности уведомление закрывается автоматически. Если не указано, значение по умолчанию составляет 4,5 секунды. Если вы установите значение 0, окно уведомлений никогда не закроется автоматически.
Уведомление со значком
Окно уведомлений со значком слева.
Уведомление с пользовательским значком
Обычные сообщения в качестве отзывов.
Уведомление с пользовательской кнопкой
Обычные сообщения в качестве отзывов.
Подтвердить всплывающее окно
Базовое подтверждение
Базовый пример.
Удалить
Уведомление с пользовательским значком
Обычные сообщения в качестве отзывов.
TL
Top
TR
LT
Left
LB
RT
Right
RB
BL
Bottom
BR
Spin
Size Spin
Spin With Background
Spin With Background description
Loading State
Alert message title
Further details about the context of this alert.
Input
Основное использование
Базовый пример использования.
Три размера ввода
Существует три размера поля ввода: большой (42 px, по умолчанию (35 px) и маленький (30 px). Примечание Внутри форм используется только большой размер.
Входная группа
Пример Input.Group Примечание. Col для управления шириной в компактном режиме не требуется.
Автоматическое изменение высоты в соответствии с содержимым
Свойство autosize для типа ввода textarea автоматически настраивает высоту в зависимости от содержимого. Объект параметров может быть предоставлен для авторазмера, чтобы указать минимальное и максимальное количество строк, которые текстовое поле будет автоматически регулировать.
Вкладка «До публикации»
Использование предусилителя и усилителя пример вкладок постов..
Текстовое поле
Для многострочных случаев пользовательского ввода может использоваться ввод, чья type prop имеет значение textarea.
Поиск
Пример создания окна поиска путем группировки стандартного ввода с кнопкой поиска
редактор
Индивидуальная форма проверки
Неудача
Должна быть комбинация цифр &amp; алфавиты
Предупреждение
Проверка
Информация проверяется...
Успех
Предупреждение
Неудача
Должна быть комбинация цифр &amp; алфавиты
Индикатор
Индикатор
Стандартный индикатор выполнения.
Круговой индикатор выполнения
Круговой индикатор выполнения.
Полоса прогресса мини-размера
Подходит для узкого участка.
Меньший круговой индикатор выполнения.
Динамический круговой индикатор выполнения
Динамический индикатор выполнения лучше.
Пользовательский формат текста
Вы можете настроить формат текста, установив формат.
Dashboard
Прогресс в стиле приборной панели.
Кнопки
Тип кнопки
Значок кнопки
Начальный
По умолчанию
Пунктирная
Опасность
поиск
поиск
поиск
поиск
Размер кнопки
Кнопка отключена
Кнопка Загрузка
Несколько кнопок
Группа кнопок
Вкладки
поиск
Отключенные вкладки
Вкладки со значками
Мини вкладки
Дополнительные вкладки действий
Позиция
Позиция табуляции слева справа вверху или внизу
Вкладки типов карт
Добавить и закрыть вкладки
Вкладки вертикального типа
Основные вкладки
Флажок
Основной флажок
Основное использование флажка.
Группа флажков
Создайте группу флажков из массива. Используйте disabled, чтобы отключить флажок.
Группа флажков
Создайте группу флажков из массива. Используйте disabled, чтобы отключить флажок.
Радио
Базовое радио
Самое простое использование. Используйте disabled, чтобы отключить радио.
Вертикальная радиогруппа
Вертикальная радиогруппа с большим количеством радиостанций.
РадиоГрупп
Группа радиодеталей.
РадиоГрупп
Группа радиодеталей.
Передача
Передача с окном поиска.
Поиск
Автозаполнение
Индивидуальные
Вы можете передать AutoComplete.Option как дочерние элементы AutoComplete вместо использования dataSource
Настроить компонент ввода
Настроить компонент ввода
Значок
Основной пример
Самое простое использование. Значок будет скрыт, когда count равен 0, но мы можем использовать showZero, чтобы показать его.
Счетчик переполнения
OverflowCount отображается, когда count больше, чем overflowCount. Значение по умолчанию для overflowCount равно 99.
Статус
Отдельный значок со статусом.
Успех
Ошибка
По умолчанию
Обработка
Предупреждение
Красный значок
Это просто отобразит красный значок без определенного количества.
Связать что-нибудь
Открытки
Базовая карта
Базовая карточка, содержащая заголовок и дополнительный контент.
Более
Название карты
Содержание карты
Lorem ipsum dolor sit amet consectetur adipisicing elit sed do eiusmod tempor incididunt ut Labore et dolore magna aliqua. Ut enim ad minim veniam quis nostrud exercitation ullamco Laboris nisi ut aliquip ex ea commodo consequat.
Без границ
Карта без полей на сером фоне.
Сетка карты
Карточки обычно взаимодействуют с сеткой на обзорной странице.
Загрузка карты
Показывает индикатор загрузки во время извлечения содержимого карты.
Какой бы ни был контент
Индивидуальный контент
Показывает индикатор загрузки во время извлечения содержимого карты.
Уличный ритм Европы
www.instagram.com
карусели
Вертикальная карусель
Вертикальная пагинация. использовать vertical=true
Базовая карусель
Основное использование
Исчезать в переходе
Слайды используют затухание для перехода. effect=fade
Прокручивать автоматически
Время прокрутки к следующему изображению карты. Автовоспроизведение
Collapse
За один раз можно развернуть более одной панели, в этом случае первая панель инициализируется. использовать defaultActiveKey= [keyNum]
Собака — это тип домашнего животного. Известный своей преданностью и верностью, он является желанным гостем во многих домах по всему миру.
Это заголовок панели 1
Это заголовок панели 2
Это заголовок панели 3
Это панель гнезда панели
Вложенный пример
Collapse вложен внутри Collapse.
Пример без полей
Безграничный стиль Collapse. использовать bordered=false
Аккордеон
В режиме аккордеона одновременно может быть развернута только одна панель. Первая панель будет расширена по умолчанию. использовать аккордеон
Popover
Основной пример
Самый простой пример. Размер плавающего слоя зависит от области содержимого.
Наведите меня
Заголовок
Три способа запуска
Мышь, чтобы щелкнуть фокус и двигаться внутрь.
Сосредоточь меня
Нажми на меня
Размещение
Доступно 12 вариантов размещения.
Вершина
Верхний левый
В правом верхнем углу
Слева вверху
Слева
Слева внизу
Правая вершина
Верно
Низ
Внизу слева
Внизу справа
Управление закрытием диалога
Используйте видимую опору для управления отображением карты.
TR
TL
LT
LB
RT
RB
BL
BR
Закрывать
Подсказка
Содержание всплывающей подсказки
Основной пример
Самое простое использование.
Размещение
Подсказка имеет 12 вариантов размещения.
TL
TR
LT
LB
RT
RB
BL
BR
Низ
Верно
Слева
Вершина
Подсказка будет отображаться при вводе мыши.
Содержание всплывающей подсказки
Теги
Основной пример
Использование базового тега, и его можно закрыть, установив свойство closable. Закрывающийся тег поддерживает события onClose afterClose.
Тег 1
Тег 2
Связь
Предотвратить дефолт
Красочный тег
Горячие Теги
Выберите любимые темы.
Горячие
Добавить и удалить динамически
Создание набора тегов по массиву, который вы можете добавлять и удалять динамически. Он основан на событии afterClose, которое будет вызвано, когда закончится анимация закрытия.
+ Новый тег
График
Основной пример
Основная временная шкала
Последний узел
Когда временная шкала неполная и продолжается, наконец, поместите призрачный узел. установить pending= true или pending= элемент React
Узнать больше
Обычай
Установите узел в качестве значка или другого пользовательского элемента.
Пример цвета
Установите цвет кругов. зеленый цвет означает завершение или состояние успеха, красный цвет означает предупреждение или ошибку, а синий цвет означает выполнение или другое состояние по умолчанию.
Создать сайт услуг 2015-09-01
Решить первоначальные проблемы с сетью 2015-09-01
Проблемы с сетью решаются 01.09.2015
Технические испытания 01.09.2015
Падать
Раскрывающееся меню при наведении
Наведите меня
Раскрывающееся меню размещения при наведении
Наведите раскрывающийся список со ссылкой «Отключить»
Щелкнул раскрывающийся список
Кнопка с выпадающим меню
Пагинация
Базовый
Более
Changer
Jumper
Mini Size
Simple Mode
Controlled
Total Number
Рейтинг
Основной пример
Самое простое использование.
Половина звезды
Поддержка выберите половину звезды.
Показать копирайтинг
Добавьте копирайтинг в ставки.
Только чтение
Только чтение не может использовать мышь для взаимодействия.
Другой персонаж
Замените звездочку по умолчанию на другой символ, например, значок алфавита или даже китайское слово.
Дерево
Базовый пример
Самое простое использование расскажет вам, как использовать проверяемые, выбираемые, отключенные, defaultExpandKeys и т. д.
Базовый контролируемый пример
базовый контролируемый пример
Перетаскиваемый пример
Перетащите узел дерева, чтобы вставить его после другого узла дерева или вставить в другой родительский узел дерева.
Загружать данные асинхронно
Чтобы загружать данные асинхронно, когда щелкните, чтобы развернуть узел дерева.
Пример с возможностью поиска
Дерево с возможностью поиска
Дерево с линией
Netscape 2.0 выпускает Javascript
Джесси Джеймс Гарретт выпускает спецификацию AJAX
Выпущен jQuery 1.0
Первый коммит underscore.js
Backbone.js становится вещью
Angular 1.0 released
React имеет открытый исходный код; разработчики радуются
Список
Сетка
по возрастанию
По убыванию
Перемешать
Повернуть
Добавить элемент
Убрать предмет
Поиск контактов
Добавить новый контакт
Выберите цвет для заметки
Добавить новую заметку
404
Похоже ты заблудился
Страница, которую вы ищете, не существует или была перемещена.
ДОМОЙ
500
Внутренняя Ошибка Сервера
Что-то пошло не так. Пожалуйста, попробуйте еще раз письмо.
ДОМОЙ
Isomorphic
Забыли пароль?
Введите адрес электронной почты, и мы вышлем вам ссылку для сброса.
Послать запрос
Isomorphic
Сброс пароля
Введите новый пароль и подтвердите его.
Сохранять
Isomorphic
Запомнить меня
Войти
демо-имя пользователя демо-пароль или Просто нажмите на любую кнопку.
Авторизоваться с помощью Фэйсбука
Войти с помощью Google Plus
Войти с Auth0
Забыли пароль
Создать изоморфную учетную запись
Isomorphic
Я согласен с условиями
Зарегистрироваться
Зарегистрируйтесь через Facebook
Зарегистрируйтесь в Google Plus
Зарегистрироваться с Auth0
У вас уже есть аккаунт? Войти.
Доход
Lorem ipsum dolor sit amet   consectetur adipisicing elit   sed do eiusmod tempor
Маркетинг
Реклама
Консалтинг
Разработка
210
Непрочитанное письмо
1749 г.
Загрузка изображения
3024
Общее сообщение
54
Почта заказов
Доход
$15000
Lorem ipsum dolor sit amet consectetur adipisicing elit sed do eiusmod tempor
Доход
$15000
Lorem ipsum dolor sit amet consectetur adipisicing elit sed do eiusmod tempor
Доход
$15000
Lorem ipsum dolor sit amet consectetur adipisicing elit sed do eiusmod tempor
Доход
$15000
Lorem ipsum dolor sit amet   consectetur adipisicing elit   sed do eiusmod tempor
110
Новые сообщения
100%
Объем
137
Достижение
Скачать
50% завершено
Служба поддержки
80% довольных клиентов
Загрузить
65% завершено
Jhon Doe
Sr. iOS Developer
Lorem ipsum dolor sit amet   consectetur adipisicing elit   sed do eiusmod tempor ammet dolar consectetur adipisicing elit
Имя
Фамилия
Название компании
Адрес электронной почты
Номер мобильного
Страна
Город
Адрес
Квартирный люкс и т. д. (опционально
Завести аккаунт?
Изображение
Имя
Фамилия
Город
улица
Эл. адрес
DOB
Базовая карта
Базовая карта (с маркером по умолчанию
Базовая карта (с пользовательским маркером значка
Базовая карта (с пользовательским маркером HTML
Базовая карта (с кластером маркеров
Базовая маршрутизация карты
Контакт не найден
ОТПРАВИТЬ
ОТМЕНА
СОСТАВИТЬ
Пожалуйста, выберите почту для чтения
КУПИТЬ СЕЙЧАС
НАСТРОЙКИ
Выбирать
Frappe Charts
Помощь
Выйти
Посмотреть все
Посмотреть корзину
Итоговая цена
`;
export default txt;
